# Кортежи (tuple)
# t = tuple  # Пустой кортеж

# t = (1,) # Аналогично
# Через индексы
cards = [('туз', 'пик'), ('дама', 'червей')]
print('Карта: ', cards[0][0])
print('Масть: ', cards[0][1])
print('Карта: ', cards[1][0])
print('Масть: ', cards[1][1])

# Через свойства кортежа (Распаковка)
card, suit = cards[0]  # ('туз', 'пик')
print('Карта: ', card)
print('Масть: ', suit)

# Взаимное присвоение
a = 3
b = 4
# Через временную переменную temp (temporary)
# temp = a  # фиксируем значение a
# a = b  # Присваиваем a значение b
# b = temp  # записываем в b сохранённое значение a

a, b = b, a  # Замена, используя возможности кортежа

print(f'a = {a}, b = {b}')
a , b = 3, 4